AcDb3dProfile.op_Assign(AcDb3dProfile!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Assignment operator.
src:
Source object to be copied.
Returns:
Reference to this object.

AcDb3dProfile.mergeProfiles(AcArray&lt;AcDb3dProfile**,AcArrayMemCopyReallocator&lt;AcDb3dProfile**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,System.Boolean,AcArray&lt;AcDb3dProfile**,AcArrayMemCopyReallocator&lt;AcDb3dProfile**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Merge connected sets of profiles into one or more profiles.
profileArr:
Input array of profiles that are to be merged.
mergeEdges:
If this parameter is false then any edge profiles in the input array will
not be merged and will be copied directly to the ouput array.
mergeCurves:
If this parameter is false then any curve profiles in the input array will
not be merged and will be copied directly to the ouput array.
mergedProfileArr:
Output array of merged profiles.  The caller is responsible for deleting all
objects that are returned in this array.
Returns:
eOk if successful.

AcDb3dProfile.isValid
Return whether the profile is valid and may be used to
create a surface.
Returns:
True if profile is a valid entity, edge, or face.

AcDb3dProfile.isEdge
Return whether the profile is an edge.
Returns:
True if profile is an edge, false otherwise.

AcDb3dProfile.isFace
Return whether the profile is a face.
Returns:
True if profile is a face, false otherwise.

AcDb3dProfile.isSubent
Return whether the profile is an edge or face.
Returns:
True if profile is an edge or face, false otherwise.

AcDb3dProfile.isPlanar
Return whether the profile is planar.
Returns:
True if profile is planar, false otherwise.

AcDb3dProfile.isClosed
Return whether the profile forms a closed loop.
Returns:
True if profile is closed, false otherwise.

AcDb3dProfile.set(AcDbEntity*)
Set the profile to an entity such as a curve or region.
pEntity:
Pointer to an AcDbEntity that is to be used as a profile to create
a surface such as an extrusion or loft.
Returns:
eOk if successful.

AcDb3dProfile.set(AcDbVertexRef!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Set the profile to a vertex.
vertexRef:
reference to the vertex
Returns:
eOk if successful.

AcDb3dProfile.set(AcDbPathRef!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Set the profile to a path.
pathRef:
reference to the path
Returns:
eOk if successful.

AcDb3dProfile.convertProfile(System.Boolean,System.Boolean,System.Boolean,System.Boolean,AcArray&lt;AcDb3dProfile**,AcArrayMemCopyReallocator&lt;AcDb3dProfile**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Converts profile into new profiles that are of a type that can be used for
extrude, revolve, sweep, or loft operations.  The converted profiles are returned in
the output array.  If this profile is of type AcDbTrace, AcDbSolid, or AcDbFace then
the converted profile will be for a region.  If this profile is of type
AcDb3dPolyline and the profile is linear or whose 'Fit' property is quadratic or
cubic then the converted profile will be a line or a spline.
explodeMultiFaceRegions:
If this profile is of type AcDbSurface or AcDbRegion and has more than one face,
then we explode to get multiple surface or region profiles that each have only
one face.
convertSurfaceToEdges:
If this profile is a face or is of type AcDbSurface, AcDbRegion, AcDbTrace,
AcDbSolid, or AcDbFace then we convert to an edge profile that is defined by
the surface or region edges.
nonPlanarOnly:
This parameter is only relevant when convertSurfaceToEdges is set to true.
If this parameter is true then only non-planar surfaces will be converted to
edge profiles.  Regions and planar surfaces will not be converted.
outerLoopOnly:
This parameter is only relevant when convertSurfaceToEdges is set to true.
If this parameter is true then only the outer loop of the surface or region
will be converted to an edge profile.
convertedProfileArr:
Output list of converted profiles.  The caller is responsible for
deleting the objects in this list.
Returns:
eOk if successful.  Even when this function returns eOk, it is possible for
the output list to be empty depending on the profile type and the values of
the other parameters.

AcDb3dProfile.getVertexRef(AcDbVertexRef*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the vertex reference of the vertex if the profile is a vertex.
If the profile is not an edge or set of edges, vertexRef will be
empty and eInvalidInput will be returned
vertexRef:
vertex reference
Returns:
Acad::ErrorStatus

AcDb3dProfile.getPathRef(AcDbPathRef*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the path reference of the edge if the profile is an edge or
set of edges.  If the profile is not an edge or set of edges, pathRef will be
empty and eInvalidInput will be returned
pathRef:
path reference of the edge(s)
Returns:
Acad::ErrorStatus

AcDb3dProfile.entity
Returns the profile entity.  If the profile is for an edge or set of
edges then the returned entity will be an AcDbCurve of the edge or edges.
The caller should not delete this pointer or post it to the database.
Returns:
Profile entity. The caller should not delete this pointer.

AcDb3dProfile.copyFrom(AcRxObject!System.Runtime.CompilerServices.IsConst*)
Copies the contents of input object into this object.
src:
Source object to be copied.
Returns:
eOk if successful.

AcDb3dProfile.Dispose
Destructor.

AcDb3dProfile.#ctor(AcDb3dProfile!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Copy constructor.
src:
Source object to be copied.

AcDb3dProfile.#ctor(AcDbVertexRef!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructor for a profile that is a vertex
vertexRef:
reference to the vertex

AcDb3dProfile.#ctor(AcDbPathRef!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructor for a profile that is a path.
pathRef:
reference to the path

AcDb3dProfile.#ctor(AcDbFullSubentPath!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructor for a profile that is a face.  The profile will consist of
the outer edges of the face.
faceSubentPath:
Subent path of the face.

AcDb3dProfile.#ctor(AcDbEntity*)
Constructor for a profile that is an entity such as a curve or region.
pEntity:
Pointer to an AcDbEntity that is to be used as a profile to create
a surface such as an extrusion or loft.

AcDb3dProfile.#ctor
Default constructor.

AcDb3dProfile
This class is used to represent a 3d profile that can be used as input to
functions such as createExtrudedSurface(), createRevolvedSurface(), and
createSweptSurface().  An object of this class can represent an entity
such as a curve or a region, or it can represent an edge or a set of edges
that form a connected chain.